package xyz.cofe.term.common;

/**
 * Цвет
 */
public enum Color {
    /** Черный - rgb(0,0,0) */
    Black,

    /** Серый - rgb(85,85,85) | rgb(128,128,128) */
    BlackBright,

    /** Красный - rgb(170,0,0) | rgb(128,0,0) */
    Red,

    /** Красный-светлый - rgb(255,85,85) | rgb(255,0,0) */
    RedBright,

    /** Зеленый - rgb(0,170,0) | rgb(0,128,0) */
    Green,

    /** Зеленый-светлый - rgb(85,255,85) | rgb(0,255,0) */
    GreenBright,

    /** Желтый - rgb(170,85,0) | rgb(128,128,0) */
    Yellow,

    /** Желтый-светлый - rgb(255,255,85) | rgb(255,255,0) */
    YellowBright,

    /** Синий - rgb(0,0,170) | rgb(0,0,128) */
    Blue,

    /** Синий-светлый - rgb(85,85,255) | rgb(0,0,255) */
    BlueBright,

    /** Фиолетовый - rgb(170,0,170) | rgb(128,0,128) */
    Magenta,

    /** Фиолетовый-светлый  - rgb(255,85,255) | rgb(255,0,255) */
    MagentaBright,

    /** Голубой(циан)  - rgb(0,170,170) | rgb(0,128,128) */
    Cyan,

    /** Голубой(циан)-светлый  - rgb(85,255,255) | rgb(0,255,255) */
    CyanBright,

    /** Светло серый - rgb(170,170,170) | rgb(0,128,128) */
    White,

    /** Белый - rgb(255,255,255) */
    WhiteBright
}
